# Taps
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'homebrew/cask-fonts'
tap 'symfony-cli/tap'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mas' # Tool to install Mac App updates
brew 'nss' # Required for symfony cli local server
brew 'tree' # List directories in a tree structure

# Development
brew 'composer'
brew 'php'
brew 'starship'
brew 'symfony-cli/tap/symfony-cli'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'beekeeper-studio'
cask 'docker'
cask 'font-fira-code'
cask 'github'
cask 'insomnia'
cask 'phpstorm'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'warp'
