# Taps
tap 'buo/cask-upgrade'
tap 'homebrew/cask-fonts'
tap 'symfony-cli/tap'
tap 'shivammathur/php'
tap 'shivammathur/extensions'
tap 'clevercloud/tap'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mas' # Tool to install Mac App updates
brew 'nss' # Required for symfony cli local server
brew 'tree' # List directories in a tree structure

# Development
brew 'clevercloud/homebrew-tap/clever-tools'
brew 'composer'
brew 'mysql-client'
brew 'n'
brew 'shivammathur/php/php@8.1'
brew 'shivammathur/extensions/amqp@8.1'
brew 'shivammathur/extensions/imagick@8.1'
brew 'shivammathur/extensions/redis@8.1'
brew 'shivammathur/extensions/pcov@8.1'
brew 'symfony-cli/tap/symfony-cli'
brew 'starship'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'beekeeper-studio'
cask 'docker'
cask 'firefox'
cask 'font-fira-code'
cask 'github'
cask 'insomnia'
cask 'phpstorm'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'warp'
